import { Container } from '@mui/material';
import 'overlayscrollbars/overlayscrollbars.css';
import { OverlayScrollbarsComponent, useOverlayScrollbars } from "overlayscrollbars-react";
import { useRef, useEffect } from 'react';
import { motion } from "framer-motion";
import uniqid from 'uniqid';

const reviews = [
    {
        userName: 'Катерина',
        text: 'Більш теплого та щирого відношення до дитини ще не бачили! Закінчили базовий курс, будемо продовжувати навчання',
        id: uniqid(),
    },
    {
        userName: 'Віолетта',
        text: 'Донька закінчила базовий курс. Дуже подобється! Відношення до дітей чудове! Будемо ходити далі. Дякую Вероніці та її батькам!',
        id: uniqid(),
    },
    {
        userName: 'Яна',
        text: 'Всім рекомендую театр мод - увага до дитини на 1000%, моя донька залишилась в захопленні!!! Будемо продовжувати ходити на основний курс',
        id: uniqid(),
    },
    {
        userName: 'Марина',
        text: 'Дочка займється, дуже задоволена, я як амма задоволена заняттями. Дуже хороший керівник. Діти до неї тянуться. Це точно, не варто вагатись, треба йти та пробувати. Діти в колективі дуже дружні. Рекомендую!',
        id: uniqid(),
    },
    {
        userName: 'Діна',
        text: 'Діти просто неймоврні, шалено талановиті та артистичні! Дякуємо нашому прекрасному керівнику!',
        id: uniqid(),
    },
    {
        userName: 'Ірина',
        text: 'Приходьте до нашої дружньої та щасливої сім\'ї під назвою TopChildren!!!! Тут ваші дітки навчаться впевненості, робити макіяж, бути самостійними та цілеспрямованими, радіти кожній миті свого життя. Раді будемо вас прийняти в нашу команду найкращих діток!',
        id: uniqid(),
    },
    {
        userName: 'Марина',
        text: 'Добрий день. Моїй дитині дуже подобається займатись! Дитина багато чому навчилась: макіяж, зачіски, походка, з\'явилась впевненість! І взагалі, прекрасний колектив, діти, батьки. А Вероніка приклад для всіх дітей! Дуже хочеться продовження занять!',
        id: uniqid(),
    },
    {
        userName: 'Вікторія',
        text: 'Дитина стала більш впевненіша, змінився характер на краще, стала самостійною, більш відкритою, багато веселих емоцій після кожного уроку. Чекємо з нетерпінням наступних занять 😘',
        id: uniqid(),
    },
    {
        userName: 'Наталія',
        text: 'Дитина стала впевненою в собі, біль розкутішою, вона повністю захопилася і поринула з головою',
        id: uniqid(),
    },
    {
        userName: 'Марія',
        text: 'Дитина навчилась природньо улибатись, красиво ходити і відчувати себе впевнено на подіумі. Із радістю спілкується з дітьми різних віків і біжить на кожне заняття',
        id: uniqid(),
    },
    {
        userName: 'Юлія',
        text: 'До самостійності ще далеко, але впевненість піднялась, супер, є на кого рівнятися!!! Колективом назвати вас - це дуже скромно, ВИ величезна сім\'я, дітки різного віку, але вони завжди допоможуть і нікого ніколи не залишають. На показі спостерігаючи за ними, видно як вони ненавмисно контролюють один одного, щоб не відстали, щоб випадково не перечипитись на сходах. Це супер, так тримати 😍😍😍. Величезне дякую за вашу працю!!!',
        id: uniqid(),
    },
    {
        userName: 'Тетяна',
        text: 'У нашої дівчинки, як не дивно, багато комплексів і багато, що їй не подобається в своїй зовнішності. Навчання вчить любити себе. Наш керівник Вероніка, дуже гарний прикоад, як потрібно йти до своєї цілі. Вероніка, ти і твої батьки, Ви великі молодці і те як Ви ставитеся до дітей, які навчаються, це супер. Дуже подобаються заняття, з нетерпінням чекаємо продовження!!!!',
        id: uniqid(),
    },
]

const Reviews = () => {
    //Какая-то странная магия, я так и не разобрался шо тут происходит
    const ref = useRef();
    const [initialize, ] = useOverlayScrollbars({});
  
    useEffect(() => {
        initialize(ref.current);
    }, [initialize]);

    return ( 
        <section className="reviews">
            <Container className='revCont'>
                <h2 className='reviews__header'>Відгуки</h2>
                <ul ref={ref} className="reviews__list">
                    <OverlayScrollbarsComponent>
                        {reviews.map(({ id, text }) => {
                            return (
                                <motion.li
                                    key={id}
                                    className={"reviews__item"}
                                    initial={{ transform: 'translateX(-60%)', opacity: 0 }}
                                    whileInView={{ transform: 'translateX(0)', opacity: 1 }}
                                    viewport={{ once: false }}
                                    transition={{ delay: 0.3, duration: 0.5 }}>
                                    {text}
                                </motion.li>
                        )
                        })}
                    </OverlayScrollbarsComponent>
                </ul>
            </Container>
        </section>
     );
}
 
export default Reviews;