const curses = [
  {
    nameOfCurse: 'Базовий',
    privileges: [
      'Термін навчання 3 місяці',
      'Базові навики акторскою майстерністю',
      'Lorem ipsum dolor sit amet.',
      'Треба ще зробити кнопку КУПИТИ чи щось типу того',
        ],
    description: 'На базовому курсі ми ставимо перед собою мету ознайомити дітей з основами модельної індустрії та театрального мистецтва. Учні матимуть змогу розвинути свої хореографічні навички, освоїть дефіле - мистецтво елегантної ходи на подіумі, та вивчать основи макіяжу для модельного образу. Безсумнівно, акторська майстерність буде однією з важливих складових, де діти дізнаються про основні прийоми акторської гри та виразовість. Завершує базовий курс навчання навички фотопозування, що допоможе майбутнім моделям виразно та професійно презентувати себе перед камерою.', 
    fakePrice: '1299',
    realPrice: '999',
    id: '1',
  },
  {
    nameOfCurse: 'Поглибленний',
    privileges: [
      'Lorem ipsum dolor sit amet.',
      'Lorem ipsum dolor sit amet.',
      'Lorem ipsum dolor sit amet.',
      'Lorem ipsum dolor sit amet consectetur adipisicing.',
      ],
    description: 'Поглиблений курс - це наступний етап у навчанні, який доступний лише для тих учнів, які успішно пройшли базовий курс. На цьому етапі ми глибше досліджуємо індустрію моди та театрального мистецтва, спрямовуючи учнів на вищий рівень вмінь та знань. В рамках поглибленого курсу діти детальніше вивчають різні аспекти модельної кар\'єри, зосереджуючись на спеціалізованих техніках ходьби, макіяжу та акторської майстерності. Навички, набуті на попередньому курсі, стають тут основою для їх подальшого розвитку. Крім того, учні поглибленого курсу будуть мати змогу брати участь у більш складних та високопрофесійних проектах, що допоможе їм отримати незамінний досвід та впевненість у собі як молодих моделей та акторів.', 
    fakePrice: '1299',
    realPrice: '999',
    id: '2',
  },
];

export default curses